1. 
¿Qué diferencia hay entre una Serie y un DataFrame?

Una serie es una columna de un df

In [1]:
import pandas as pd
import numpy as np

2. Es el turno de los DataFrames
- Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [5]:
array1 = np.random.randint(1,50, (4,3))

- Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [10]:
pd.DataFrame(array1, columns= ["España", "Francia", "Italia"])

   España  Francia  Italia
0      30       20      15
1      27       26      35
2      43       47      20
3      44       20      47

- Descarga el archivo "medallas" y carga el DataFrame.

In [13]:
df_medallas = pd.read_csv("medallas.csv", index_col = 0)

In [17]:
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

- Usando el loc extrae todas las columnas de la fila de Tailandia

In [19]:
df_medallas.loc[df_medallas["País"] == "Tailandia"]

        País  Oro  Plata  Bronce
7  Tailandia  132    175     278

- Usando el loc extrae todas las columnas de China e Irán.

In [24]:
df_medallas.loc[(df_medallas["País"] == "China") | (df_medallas["País"] =="Irán")]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

- Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [31]:
df_medallas.loc[(df_medallas["País"] == "China") | (df_medallas["País"] =="Irán"), ["Oro", "Plata"]]

    Oro  Plata
1  1473    994
4   179    181


- Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [40]:
df_medallas.loc[6, :]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

- Usando el iloc extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [43]:
df_medallas.loc[::1]

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235